# -*- coding: utf-8 -*-
#+TITLE: Posts
#+AUTHOR: Tony aldon
#+DATE: <2022-04-13 Wed 18:21>

# This document is meant to be read inside Emacs.  To make the internal
# local links to Emacs and Org-mode repositories work correctly,
# make sure to clone those repositories under this directory:
#
#    git clone git://git.sv.gnu.org/emacs.git
#    git clone https://git.savannah.gnu.org/git/emacs/org-mode.git

#+LINK: emacs      ./emacs/
#+LINK: org-mode   ./org-mode/

*** How do you count 5000 examples?

Any ~should~, ~should-not~ and ~should-error~ used in a ~ert~ test in the
repository [[org-mode:testing]] is counted as an example.

So now, to count all the examples, we have to count all those form and
this can be done by searching recursively in the [[org-mode:testing]] for
the string ~(should~.

This can be done using ~grep~ to match recursively the string ~(should~ in
the directory [[org-mode:testing]] and counting the number of line with ~wc~
utility:

#+BEGIN_SRC bash
# org-mode at commit cbe3f2d69
cd org-mode/testing/
grep -r '(should' | wc -l
#+END_SRC

#+RESULTS:
: 5235
